balazsgrill/modembed/res/Devices/dsPIC30/PIC24F32KA301.PIC
        <edc:SFRDef edc:access="nnn----n--------" edc:cname="ULPWCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----0--------" edc:name="ULPWCON" edc:nzwidth="16" edc:por="000----0--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="ULPSINK" edc:desc="" edc:mask="0x1" edc:name="ULPSINK" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ULPSIDL" edc:desc="" edc:mask="0x1" edc:name="ULPSIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PFRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="PFRZ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ULPEN" edc:desc="" edc:mask="0x1" edc:name="ULPEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="nnnnn---nnnnn--n" edc:cname="PMD1" edc:desc="" edc:impl="0xf8f9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000---000x0--0" edc:name="PMD1" edc:nzwidth="0x10" edc:por="00000---000x0--0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1MD" edc:desc="" edc:mask="0x1" edc:name="ADC1MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2MD" edc:desc="" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3MD" edc:desc="" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4MD" edc:desc="" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5MD" edc:desc="" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn-----nnn" edc:cname="PMD2" edc:desc="" edc:impl="0x707" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000-----000" edc:name="PMD2" edc:nzwidth="0x10" edc:por="-----000-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3MD" edc:desc="" edc:mask="0x1" edc:name="IC3MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nn-n-----n-" edc:cname="PMD3" edc:desc="" edc:impl="0x782" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00-0-----0-" edc:name="PMD3" edc:nzwidth="0x10" edc:por="-----00-0-----0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="CRCPMD" edc:desc="" edc:mask="0x1" edc:name="CRCPMD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMPMD" edc:desc="" edc:mask="0x1" edc:name="CMPMD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------n--nnnn-" edc:cname="PMD4" edc:desc="" edc:impl="0x1e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0--0000-" edc:name="PMD4" edc:nzwidth="0x10" edc:por="--------0--0000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="HLVDMD" edc:desc="" edc:mask="0x1" edc:name="HLVDMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTMUMD" edc:desc="" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REFOMD" edc:desc="" edc:mask="0x1" edc:name="REFOMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEMD" edc:desc="" edc:mask="0x1" edc:name="EEMD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ULPWUMD" edc:desc="" edc:mask="0x1" edc:name="ULPWUMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd003a" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x800" edc:endaddr="0x1000" edc:regionid="data"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="VPP"/>
      <edc:VirtualPin edc:name="RA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="PGEC2"/>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="CVREF+"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="CN2"/>
      <edc:VirtualPin edc:name="RA0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="PGED2"/>
      <edc:VirtualPin edc:name="CVREF-"/>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="SDO2"/>
      <edc:VirtualPin edc:name="CN3"/>
      <edc:VirtualPin edc:name="RA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="PGED1"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="ULPWU"/>
      <edc:VirtualPin edc:name="CTCMP"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="C3IND"/>
      <edc:VirtualPin edc:name="U2TX"/>
      <edc:VirtualPin edc:name="SDI2"/>
      <edc:VirtualPin edc:name="OC2"/>
      <edc:VirtualPin edc:name="CN4"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="PGEC1"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="U2RX"/>
      <edc:VirtualPin edc:name="OC3"/>
      <edc:VirtualPin edc:name="CTED12"/>
      <edc:VirtualPin edc:name="CN5"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="T5CK"/>
      <edc:VirtualPin edc:name="T4CK"/>
      <edc:VirtualPin edc:name="U1RX"/>
      <edc:VirtualPin edc:name="CTED13"/>
      <edc:VirtualPin edc:name="CN6"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="OSCI"/>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="CN30"/>
      <edc:VirtualPin edc:name="RA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="OSCO"/>
      <edc:VirtualPin edc:name="AN14"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="CN29"/>
      <edc:VirtualPin edc:name="RA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="PGED3"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="AN15"/>
      <edc:VirtualPin edc:name="U2RTS"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="PGEC3"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="SCLKI"/>
      <edc:VirtualPin edc:name="U2CTS"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="U1TX"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="CN23"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="U1CTS"/>
      <edc:VirtualPin edc:name="C3OUT"/>
      <edc:VirtualPin edc:name="CTED10"/>
      <edc:VirtualPin edc:name="CN22"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="U1RTS"/>
      <edc:VirtualPin edc:name="IC2"/>
      <edc:VirtualPin edc:name="CTED4"/>
      <edc:VirtualPin edc:name="CN21"/>
      <edc:VirtualPin edc:name="RB9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="C2OUT"/>
      <edc:VirtualPin edc:name="OC1"/>
      <edc:VirtualPin edc:name="IC1"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="INT2"/>
      <edc:VirtualPin edc:name="CN8"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="SS2"/>
      <edc:VirtualPin edc:name="IC3"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="RB12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="SDO1"/>
      <edc:VirtualPin edc:name="OCFB"/>
      <edc:VirtualPin edc:name="CTPLS"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="RB13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="CVREF"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="SDI1"/>
      <edc:VirtualPin edc:name="C1OUT"/>
      <edc:VirtualPin edc:name="OCFA"/>
      <edc:VirtualPin edc:name="CTED5"/>
      <edc:VirtualPin edc:name="INT1"/>
      <edc:VirtualPin edc:name="CN12"/>
      <edc:VirtualPin edc:name="RB14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="T3CK"/>
      <edc:VirtualPin edc:name="T2CK"/>
      <edc:VirtualPin edc:name="REFO"/>
      <edc:VirtualPin edc:name="SS1"/>
      <edc:VirtualPin edc:name="CTED6"/>
      <edc:VirtualPin edc:name="CN11"/>
      <edc:VirtualPin edc:name="RB15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="VSS"/>
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="VDD"/>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>